{
  "model_type": "medassist_gpt",
  "architectures": [
    "MedAssistGPTForCausalLM"
  ],
  "vocab_size": 50281,
  "hidden_size": 512,
  "num_attention_heads": 16,
  "num_key_value_heads": 4,
  "intermediate_size": 2048,
  "num_hidden_layers": 16,
  "max_position_embeddings": 1024,
  "layer_norm_eps": 1e-05,
  "hidden_dropout_prob": 0.1,
  "attention_dropout_prob": 0.1,
  "torch_dtype": "bfloat16"
}